app/Models/UsuariosModel.php

SELECT *
FROM `usuarios`
WHERE `user` = 'nuevo'
AND `active` = 1
 LIMIT 1
---
    public function validacionUsuario($usuario, $password){
        //echo "usuario: ". $usuario;
        $datosUsuario = $this->where([
            'user'=>$usuario,
            'active'=>1
            ])->first();